/**
 ******************************************************************************
 * @file tim_callback.h
 * @brief 定时器回调函数声明
 * 
 * 本文件包含定时器中断回调函数的声明和相关类型定义。
 * 用于处理定时器中断事件的回调机制。
 * 
 * @author 
 * @date 
 * @version 1.0
 * 
 * @copyright Copyright (c) 2024
 * 
 * @note 此文件为定时器回调函数的头文件，需要在使用定时器中断时包含
 ******************************************************************************
 */

#ifndef __TIM_CALLBACK_H
#define __TIM_CALLBACK_H
#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "sys_timestamp.h"

/* Exported types ------------------------------------------------------------*/


/* Exported constants --------------------------------------------------------*/


/* Exported macro ------------------------------------------------------------*/


/* Exported functions prototypes ---------------------------------------------*/


#ifdef __cplusplus
}
#endif

#endif /* __TIM_CALLBACK_H */